Revit 2024 API
BuiltInFailures.GeneralFailures.UnspecifiedError Property
 Revit has experienced an unexpected error. The operation has been cancelled to protect your project from corruption.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnspecifiedError { get; }
Visual Basic
Public Shared ReadOnly Property UnspecifiedError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnspecifiedError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace